package Collection;

public class Introduction {

}

/*
	Στο πλαίσιο συλλογών της Java, υποστηρίζει δύο μορφές δομών:

Μια δομή για την αποθήκευση μιας συλλογής στοιχείων (Συλλογή).
Μια δομή, για την αποθήκευση ζευγών κλειδιού/τιμής (Απεικόνιση).

	Οι απεικονίσεις αναζητούν με μεγάλη ταχύτητα ένα στοιχείο με χρήση ενός κλειδιού.
	Συλλογές:

List -> Αποθηκεύουν, μια διατεταγμένη συλλογή στοιχείων.
Set -> Αποθηκεύουν, μια ομάδα μη διπλότυπων στοιχείων.
Stack -> Αποθηκεύουν ΑΝΤΙΚΕΙΜΕΝΑ, όπου τα επεξεργαζόμαστε με πειθαρχία Lifo (Επεκτείνει την Vector).
Queue -> Αποθηκεύουν ΑΝΤΙΚΕΙΜΕΝΑ, όπου τα επεξεργαζόμαστε με πειθαρχία Fifo.
QueuePriority -> Παρόμοια με την Queue, αλλά με προτεραιότητα.

*/

/*

H Η διεπαφή Collection επεκτείνει την Iterable και ορίζει τις κοινές πράξεις που αφορούν τις:

Λίστες (Lists)
Τα σύνολα (Sets)
Τα διανύσματα (Vectors)
Τις στοίβες (Stacks)
Τις ουρές (Queues)
Τις ουρές προτεραιότητας (QueuePriorities)

*/