package Differences;
import Hotel_Example.*; // import.package_name.class.name;
public class Read_Class_From_Other_Package {
Client c; // Για να είναι έγκυρη αυτή η δήλωση θα πρέπει αυτή η κλάση να βρίσκεται μέσα στο πακέτο ή εάν δεν βρίσκεται θα πρέπει να εισάγουμε το πακέτο και το όνομα της κλάσης.
}

/*  Όσο αναφορά την C#
 * 
 * Μια μεταβλητή μπορεί να έχει 3 τύπους εμβέλεις: (Εμβέλεια είναι το τμήμα του προγράμματος που είναι ορατή η μεταβλητή).
 * 
 * Εμβέλεια κλάσης. (Από την αρχή μέχρι το τέλος του προγράμματος, και ορατή μέσα σε όλες τις κλάσεις).
 * Εμβέλεια τμήματος κλάσης. (Μέσα σε μια μέθοδο και μέσα σε έναν βρόγχο).
 * Εμβέλεια αντικειμένου. (Με public είναι προσπελάσιμη σε κάθε αντικείμενο της κλάσης αυτής).
 * 
 * Μια κλάση μπορεί να έχει 2 τύπους εμβέλειας:
 * 
 * Εμβέλεια αρχείου. (Μέσα στο αρχείο που έχει ορισθεί) (Εάν έχει ορισθεί σε άλλη κλάση, στο ίδο αρχείο, τότε για να είναι ορατή θα πρέπει να είναι public).
 * Εμβέλεια χώρου ονομάτων (namespace). (Όλες οι κλάσεις που ανήκουν στο ίδιο χώρο ονομάτων είναι ορατές μεταξύ του, ακόμη και αν βρίσκονται σε διαφορετικά αρχεία)
 * 
 * (Για να έχουμε πρόσαση σε αρχεία με διαφορετικό χώρο ονομάτων θα πρέπει να χρησιμοποιήσουμε την έκφραση using name_namespace)
 */

/*
 Επομένως η διαφορά όσο αναφορά την Java και την C# είναι ότι η java χρησιμοποιεί τα packages ενώ η C# τα namespaces.

*/