package Basics;

public class PackagesClass {
/* Πακέτα:
 * 
 * Τα πακέτα στην Java είναι ένας μηχανισμός για την ενσωμάτωση ενός group από classes, subpackages και interfaces.
 * 
 * Τα πακέτα χρησιμοποιούνται στην Java για να αποτρέπονται οι διανέξεις ονομασίας (naming conflicts),
 * να ελέγχεται η πρόσβαση, να διευκολύνεται η αναζήτηση/εντπισμός και η χρήση των
 * classes, interfacesm enumerations και annotations ευκολότερη.
 * 
 * Ορισμένα από τα ήδη υπάρχον πακέτα (Built-in packages) στην java είναι:
 * 
 * java.lang -> Περιέχει classes που υποστηρίζει η γλώσσα (luanguage support classes), για παράδειγμα, classes που ορίζει πρωτόγονους τύπους δεδομένων, πράξεις μαθηματικών).
 * Αυτό το πακέτο εισάγεται αυτόματα.
 * 
 * java.io -> Περιέχει classes για την υποστήριξη input/output λειτουργιών.
 * java.util -> Περιέχει utility classes που υλοποιούν δομές δεδομένων όπως LinkedList, Dictionary, Date, Time, Random.
 * java.applet -> Περιέχει classes για την δημιουργία Applets
 * java.awt -> Περιέχει classes για την εφαρμογή των components για GUI.
 * java.net -> Περιέχει classes για την υποστήριξη networking λειτουργίες.
 * 
 * import.java.<packagename>.<classname>
 * 
 * Κλάσεις που βρίσκονται σε διαφορετικά πακέτα θα πρέπει να της εισάγουμε.
 * 
 * Εάν θέλουμε να χρησιμοποιήση μια κλάση άλλη, και αυτή βρίσκεται μέσα στο πακέτα,
 * το μόνο που πρέπει να κάνει να δημιουργήσει ένα αντικειμενό της.
 * 
 * Οι προγραμματιστές, μπορούν να ορίσουν τα δικά τους πακέτα για την δέσμευση/συσσώρευση groups από classes/interfaces κ.λ.π.
 * Είναι μια καλή τεχνική να ομαδοποιήσουμε συναφής classes
 * που εφαρμόζονται από εμάς έτσι ώστε να μπορεί ένας προγραμματιστής εύκολα να προσδιορίσει ότι
 * οι classes, interfaces, anumerations και τα annotations σχετίζονται.
 * 
 * Αυτά είναι τα πακέτα που ορίζονται από τον χρήστη.
 */
	
	
	
	
	
	
	
	
	
	
	
	
	
}
