package Basics;

public class Printf {

	public static void main(String[] args) {
		double price = 19.5;
		System.out.println("Price using println" + price);
		System.out.printf("%1.3f", price);
	}
}

/*
 * %c -> Χαρακτήρας                                        |%2c, Μεμονωμένος χαρακτήρας με πεδίο 2 θέσεων.
 * %d -> Ακέραιος αριθμός                                  |%5d, Ένας ακέραιος με πεδίο 5 θέσεων.
 * %f -> Αριθμός κινητής υποδιαστολής                      |%1.2f, Ένας αριθμός κιν. υποδ. με  2 ψηφία μετά την υποδιαστολή.
 * %e -> Αριθμός κινητής υποδιαστολής με εκθετική μορφή.   |%6.2φ, Ένας αριθμός κιν. υποδ. με  2 ψηφία μετά την υποδιαστολή, σε ένα πεδίο 6 θέσεων.
 * %s -> Συμβολοσειρά.                                     |%10s, Μια σειμβολοσειρά, σε πεδίο 10 θέσεων.
 */