import static org.junit.Assert.*;

import org.junit.Test;

public class CalculatorTest2 {

	@Test
	public void testAdd() {
		Calculator cal = new Calculator();
		double result = cal.add(20,40);
		assertEquals(60, result, 0);
	}

}

/* 
 * Assert: Επιτρέπει τον καθορισμό των συνθηκών που θέλουμε να ελεγχθούν.
 * 
 * Test@: Ορίζει έναν έλεγχο μονάδας. Για να τρέξει αυτή η κλάση, κατασκευάζει ένα νέο στιγμιότυπο
 * της κλάσης που το περιέχει και στην συνέχεια καλεί σε αυτό το στογμιότυπο την επισημασμένη μέθοδο.
 * 
 * TestClass: Μια κλάση ελέγχου, περιέχει μεθόδους ελέγχου.
 * 
 * Suite: Μια σουίτα, επιτρέπει την ομαδοποίηση κλάσεων ελέγχου, έτσι ώστε να εκτελούνται όλες μαζί.
 * 
 * Runner: Μια κλάση εκτέλεσης, είναι μια κλάση του JUnit που εκτελεί ελέγχους.
 * 
 */
